# Общие флаги для компиляторов GCC.
set(GENERAL_GCC_COMPILE_FLAGS
        -Wall                   # Показывать больше предупреждений
        -Wextra                 # Еще больше предупреждений!
        -pedantic               # Проверяет код на соответствие ISO C и ISO C++
        -fstack-usage           # Cгенерировать файл, в котором указан максимальный объем используемого стека
                                # для каждой функции
        -ffunction-sections     # Помещает каждую функцию (включая статические) в собственный раздел text.func_name
        -fdata-sections         # Помещает каждую глобальную и статическую переменную в собственный раздел
        -fno-exceptions         # Отключаем исключения для экономии ROM и ускорения работы
        -Wno-unknown-pragmas    # Подавляем ошибку о неизвестных pragma'х
        -Wduplicated-branches   # Отслеживает одинаковые ветви if-else
        -Wduplicated-cond       # Отслеживает одинаковые условия в if-else
        -Wfloat-equal           # Пытаемся проверить на равенство числа с плавающей точкой
        -Wcast-qual             # Предупреждает о преобразовании указателя, при котором сбрасываются квалификаторы
        -Wconversion            # Предупреждает о неявном преобразовании, где мы можем терять данные
        -Wsign-conversion       # Предупреждает о неявном преобразовании, где мы можем терять знак
        -Wshadow=global         # Предупреждает о "затенении" одной переменной другой
        -Wsizeof-array-div      # Предупреждает о разных типах внутри sizeof при делении одного sizeof на другое
        -Wlogical-op            # Предупреждает что в условии одинаковые логические операнды
        $<$<COMPILE_LANGUAGE:ASM>:
        ${CMAKE_ASM_FLAGS}
        -c                      # Останавливает на стадии ассемблирования, но пропускает компоновку
        -x assembler-with-cpp   # Явно указывает язык. Позволяет работать с файлами .s вместо .S
        >
    $<$<COMPILE_LANGUAGE:C>:
        ${CMAKE_C_FLAGS}
        -std=gnu11              # Версия C
        >
    $<$<COMPILE_LANGUAGE:CXX>:
        ${CMAKE_CXX_FLAGS}
        -std=gnu++17            # Версия C++
        -fuse-cxa-atexit        # Поддержка __cxa_atexit для статических деструкторов
        -Wctor-dtor-privacy     # Предупреждает что закрытые конструктор или деструктор выглядят неиспользуемыми
        -Wnon-virtual-dtor      # Предупреждает что у класса есть виртуальные члены, но деструктор не виртуальный
        -Woverloaded-virtual    # Предупреждает о попытке дочернего класса перегрузить виртуальную функцию родителя
        -Wsign-promo            # Предупреждает о неочевидном вызове перегруженной функции
        >)